[M_TestingZone MissionDefinition]
MissionDescription="Patricia Tannis has set up a training course for the Crimson Raiders of Sanctuary. Tannis filled the gauntlet, situated on [place]Digistruct Peak[-place], with dozens of digital reconstructions of Pandoran baddies.<br><br>Her goal is simple: she will record your biometric data as you fight your way through the gauntlet. Then, by using a combination of digistruct technology and Eridium engineering, she will give you the power of a god.<br><br>Come to think of it, perhaps ''simple'' wasn't the right word."
TurnInDescription="Congratulations! You've successfully killed a bunch of simulated living organisms.<br><br>And also in the gauntlet."
MissionSummary="Survive Tannis's Digistruct Training Gauntlet."
MissionGiver="Dr. Patricia Tannis"
MissionTurnInLocation="Dr. Patricia Tannis"

[M_TestingZone:Assemblefordeath MissionObjectiveDefinition]
ProgressMessage="Proceed down the elevator of death"

[M_TestingZone:ContinueTraining MissionObjectiveDefinition]
ProgressMessage="Befriend enemies (just kidding, kill them)"

[M_TestingZone:FixGenerator MissionObjectiveDefinition]
ProgressMessage="Fix generator"

[M_TestingZone:Movetonextarea MissionObjectiveDefinition]
ProgressMessage="Continue to next area"

[M_TestingZone:Pickplants MissionObjectiveDefinition]
ProgressMessage="Pick up snow onions"

[M_TestingZone:ReachtheEnd MissionObjectiveDefinition]
ProgressMessage="Proceed to elevator exit"

[M_TestingZoneRepeatable MissionDefinition]
MissionDescription="Patricia Tannis has set up a training course for the Crimson Raiders of Sanctuary. Tannis filled the gauntlet, situated on [place]Digistruct Peak[-place], with dozens of digital reconstructions of Pandoran baddies.<br><br>Her goal is simple: she will record your biometric data as you fight your way through the gauntlet. Then, by using a combination of digistruct technology and Eridium engineering, she will give you the power of a god.<br><br>Come to think of it, perhaps ''simple'' wasn't the right word."
TurnInDescription="Congratulations! You've successfully killed a bunch of simulated living organisms.<br><br>And also in the gauntlet."
MissionSummary="Survive Tannis's Digistruct Training Gauntlet."
MissionGiver="Dr. Patricia Tannis"
MissionTurnInLocation="Dr. Patricia Tannis"

[M_TestingZoneRepeatable:Assemblefordeath MissionObjectiveDefinition]
ProgressMessage="Proceed down the elevator of death"

[M_TestingZoneRepeatable:ContinueTraining MissionObjectiveDefinition]
ProgressMessage="Befriend enemies (just kidding, kill them)"

[M_TestingZoneRepeatable:Movetonextarea MissionObjectiveDefinition]
ProgressMessage="Continue to next area"

[M_TestingZoneRepeatable:Pickplants MissionObjectiveDefinition]
ProgressMessage="Pick up snow onions"
